modules/custom/sap-integration-services/src/main/resources/text.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns2:ZPeActJornadaNomina xmlns:ns2="urn:sap-com:document:sap:soap:functions:mc-style">
            <TEmpleados>
                <fechaInicio>2023-09-15</fechaInicio>
                <heFin>2023-09-15T10:18:40.000Z</heFin>
                <heInicio>2023-09-15T13:18:43.000Z</heInicio>
                <heTipoRetribucion>4</heTipoRetribucion>
                <pernr>1002982</pernr>
            </TEmpleados>
        </ns2:ZPeActJornadaNomina>
    </soap:Body>
</soap:Envelope>


<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
    <ns2:ZPeActJornadaNomina xmlns:ns2="urn:sap-com:document:sap:soap:functions:mc-style">
        <TEmpleados>
            <fechaInicio>2023-10-15</fechaInicio>
            <heFin>20:00</heFin>
            <heInicio>18:00</heInicio>
            <heTipoRetribucion>4</heTipoRetribucion>
            <pernr>1002982</pernr>
        </TEmpleados>
    </ns2:ZPeActJornadaNomina>
</soap:Body>
</soap:Envelope>